export const searchingFor = {
	label: 'আমি খুঁজছি',
	selected: 'সকল বায়োডাটা',
	dropdown: true,
	options: ['পাত্রের বায়োডাটা', 'পাত্রীর বায়োডাটা'],
}

export const maritalStatus = {
	label: 'বৈবাহিক অবস্থা',
	selected: 'সকল',
	dropdown: true,
	options: ['অবিবাহিত', 'বিবাহিত', 'ডিভোর্সড', 'বিধবা', 'বিপত্নীক'],
};

export const allDivision = {
	label: 'বিভাগ',
	selected: 'সকল বিভাগ',
	dropdown: true,
	options: [
		'ঢাকা বিভাগ',
		'চট্টগ্রাম বিভাগ',
		'রাজশাহী বিভাগ',
		'খুলনা বিভাগ',
		'বরিশাল বিভাগ',
		'সিলেট বিভাগ',
		'রংপুর বিভাগ',
		'ময়মনসিংহ বিভাগ',
	],
};

export const allDistrict = {
	selected: 'সকল জেলা',
	options: [
		'বাগেরহাট',
		'বান্দরবান',
		'বরগুনা',
		'বরিশাল',
		'ভোলা',
		'বগুড়া',
		'ব্রাহ্মণবাড়িয়া',
		'চাঁদপুর',
		'চাঁপাইনবাবগঞ্জ',
		'চট্টগ্রাম',
		'চুয়াডাঙ্গা',
		'কক্স বাজার',
		'কুমিল্লা',
		'ঢাকা',
		'দিনাজপুর',
		'ফরিদপুর',
		'ফেনী',
		'গাইবান্ধা',
		'গাজীপুর',
		'গোপালগঞ্জ',
		'হবিগঞ্জ',
		'জামালপুর',
		'যশোর',
		'ঝালকাঠী',
		'ঝিনাইদহ',
		'জয়পুরহাট',
		'খাগড়াছড়ি',
		'খুলনা',
		'কিশোরগঞ্জ',
		'কুড়িগ্রাম',
		'কুষ্টিয়া',
		'লক্ষ্মীপুর',
		'লালমনিরহাট',
		'মাদারীপুর',
		'মাগুরা',
		'মানিকগঞ্জ',
		'মেহেরপুর',
		'মৌলভীবাজার',
		'মুন্সিগঞ্জ',
		'ময়মনসিংহ',
		'নওগাঁ',
		'নড়াইল',
		'নারায়ণগঞ্জ',
		'নরসিংদী',
		'নাটোর',
		'নেত্রকোনা',
		'নিলফামারী',
		'নোয়াখালী',
		'পাবনা',
		'পঞ্চগড়',
		'পটুয়াখালী',
		'পিরোজপুর',
		'রাজবাড়ী',
		'রাজশাহী',
		'রাঙ্গামাটি',
		'রংপুর',
		'সাতক্ষীরা',
		'শরিয়তপুর',
		'শেরপুর',
		'সিরাজগঞ্জ',
		'সুনামগঞ্জ',
		'সিলেট',
		'টাঙ্গাইল',
		'ঠাকুরগাঁও',
	],
}; 

export const dhakaDistrict = {
	selected: 'গাজীপুর',
	options: [
		'নরসিংদী',
		'গাজীপুর',
		'শরীয়তপুর',
		'নারায়ণগঞ্জ',
		'টাঙ্গাইল',
		'কিশোরগঞ্জ',
		'মানিকগঞ্জ',
		'ঢাকা',
		'মুন্সিগঞ্জ',
		'রাজবাড়ী',
		'মাদারীপুর',
		'গোপালগঞ্জ',
		'ফরিদপুর',
	],
}; 

export const chittagongDistrict = {
	selected: 'রাঙ্গামাটি',
	options: [
		'কুমিল্লা',
		'ফেনী',
		'ব্রাহ্মণবাড়িয়া',
		'রাঙ্গামাটি',
		'নোয়াখালী',
		'চাঁদপুর',
		'লক্ষ্মীপুর',
		'চট্টগ্রাম',
		'কক্স বাজার',
		'খাগড়াছড়ি',
		'বান্দরবান',
	],
};

export const rajshahiDistrict = {
	selected: 'সিরাজগঞ্জ',
	options: [
		'সিরাজগঞ্জ',
		'পাবনা',
		'বগুড়া',
		'রাজশাহী',
		'নাটোর',
		'জয়পুরহাট',
		'চাঁপাইনবাবগঞ্জ',
		'নওগাঁ',
	],
};

export const khulnaDistrict = {
	selected: 'যশোর',
	options: [
		'যশোর',
		'সাতক্ষীরা',
		'মেহেরপুর',
		'নড়াইল',
		'চুয়াডাঙ্গা',
		'কুষ্টিয়া',
		'মাগুরা',
		'খুলনা',
		'বাগেরহাট',
		'ঝিনাইদহ',
	],
};
export const barishalDistrict = {
	selected: 'ঝালকাঠী',
	options: ['ঝালকাঠী', 'পটুয়াখালী', 'পিরোজপুর', 'বরিশাল', 'ভোলা', 'বরগুনা'],
};

export const sylhetDistrict = {
	selected: 'মৌলভীবাজার',
	dropdown: true,
	options: ['সিলেট', 'মৌলভীবাজার', 'হবিগঞ্জ', 'সুনামগঞ্জ'],
};

export const rangpurDistrict = {
	selected: 'পঞ্চগড়',
	options: [
		'পঞ্চগড়',
		'দিনাজপুর',
		'লালমনিরহাট',
		'নীলফামারী',
		'গাইবান্ধা',
		'ঠাকুরগাঁও',
		'রংপুর',
		'কুড়িগ্রাম',
	],
};

export const moymonsinghDistrict = {
	selected: 'শেরপুর',
	options: ['শেরপুর', 'ময়মনসিংহ', 'জামালপুর', 'নেত্রকোনা'],
};

// create district Map
export const district = new Map();

district.set('সকল বিভাগ', allDistrict);
district.set('ঢাকা বিভাগ', dhakaDistrict);
district.set('চট্টগ্রাম বিভাগ', chittagongDistrict);
district.set('রাজশাহী বিভাগ', rajshahiDistrict);
district.set('খুলনা বিভাগ', khulnaDistrict);
district.set('বরিশাল বিভাগ', barishalDistrict);
district.set('সিলেট বিভাগ', sylhetDistrict);
district.set('রংপুর বিভাগ', rangpurDistrict);
district.set('ময়মনসিংহ বিভাগ', moymonsinghDistrict);