export const faqData = [
	{
    id: 1,
		question: 'বায়োডাটা জমা দিতে কত টাকা লাগে?',
		answer: 'আমরা এখন পর্যন্ত কারো কাছ থেকে টাকা নিচ্ছি না।?',
	},
	{
    id: 2,
		question: 'এই ওয়েবসাইট কি সবার জন্য উন্মুক্ত?',
		answer: 'না, এই ওয়েবসাইট সবার জন্য নয়, এই ওয়েবসাইট শুধুমাত্র দ্বীনদার মুসলিমদের জন্য। ',
	},
	{
    id: 3,
		question: 'বায়োডাটা তৈরি করার কোনো বিশেষ শর্ত আছে?',
		answer: 'আমাদের ওয়েবসাইটে বায়োডাটা তৈরি করতে হলে নূন্যতম আবশ্যকতা নিম্নরূপ-'
	},
	{
    id: 4,
		question: 'আমার বায়োডাটা এপ্রুভ হয় নি কেন?',
		answer: 'আমরা বিভিন্ন কারণে বায়োডাটা এপ্রুভ করি না। তার মাঝে কয়েকটি কারণ উল্লেখ করা হলো।'
	},
	{
    id: 5,
		question: 'কিছু তথ্য সঠিকভাবে না দেয়ার কারণে আমার বায়োডাটা এপ্রুভ হয় নি, আমি কি আবার বায়োডাটা জমা দিতে পারবো?',
		answer: 'হ্যাঁ পারবেন। যে ঘরে ভুল তথ্য দেয়ার জন্য আপনার বায়োডাটা নট এপ্রুভ করা হয়েছে, সেই ঘরে সঠিক তথ্য দিয়ে Save Changes ক্লিক করে Publish Biodata করবেন তাহলে এপ্রুভ করা হবে ইন শা আল্লাহ। তবে উপরের প্রশ্নের উত্তরে উল্লিখিত বিশেষ শর্ত না থাকার কারণে যদি বায়োডাটা নট এপ্রুভ হয় তাহলে আর এপ্রুভ হবে না।'
	},
	{
    id: 6,
		question: 'আমি ৫ ওয়াক্ত নামাযী, কিন্ত আমি সুন্নতী দাঁড়ি রাখি নি, আমি বায়োডাটা আপলোড করতে পারবো?',
		answer: 'না, আপনি বায়োডাটা আপলোড করলে এপ্রুভ করা হবে না। যাদের ওয়াজিব দাড়ি আছে শুধুমাত্র তাদের বায়োডাটা এপ্রুভ করা হবে।'
	},
	{
    id: 7,
		question: 'আমি ৫ ওয়াক্ত নামাযী, আমি বোরকা ও হিজাব পরি তবে নিকাব করি না। আমি বায়োডাটা আপলোড করতে পারবো?',
		answer: 'না, আপনি বায়োডাটা আপলোড করলে এপ্রুভ করা হবে না। যারা নিকাব সহ বোরকা পরেন শুধুমাত্র তাদের বায়োডাটা এপ্রুভ করা হয়।'
	},
	{
    id: 8,
		question: 'আমার অভিভাবক আমার বিয়েতে রাজি নয়, আমি কি বায়োডাটা জমা দিতে পারবো?',
		answer: 'না। আপনি পাত্র/পাত্রী যেই হোন না কেন, আমাদের ওয়েবসাইটে বায়োডাটা তৈরি করতে হলে অবশ্যই অভিভাবকের অনুমতি নিয়ে জমা দিতে হবে। অন্যথায় বায়োডাটা এপ্রুভ করা হবে না।'
	},
	{
    id: 9,
		question: 'আমি একজন ছাত্র, আমার এখনো কোনো আয় নেই, আমি কি বায়োডাটা আপলোড করতে পারবো?',
		answer: 'হ্যাঁ, পারবেন। তবে অবশ্যই আপনার অভিভাবকের অনুমতি নিয়ে বায়োডাটা তৈরি করতে হবে।'
	},
	{
    id: 10,
		question: 'বায়োডাটা জমা দেয়ার পর বিয়ে হয়ে গেলে বা অন্য কারণে বায়োডাটা ডিলিট করতে পারবো?',
		answer: 'হ্যাঁ, আপনার যখন ইচ্ছা তখন বায়োডাটা ডিলিট করতে পারবেন। বায়োডাটা ডিলিট করতে ই-মেইল এর মাধ্যমে যোগাযোগ করুন।'
	},
	{
    id: 11,
		question: 'একজনের বায়োডাটা আরেকজন তৈরি করতে পারবে?',
		answer: 'আমাদের বায়োডাটা ফর্মে অনেক ব্যক্তিগত প্রশ্ন আছে, যেগুলোর উত্তর একমাত্র পাত্র-পাত্রী নিজেই ভাল জানেন। পরিবারের অন্য কেউ যদি ফর্মটি তৈরি করে দেন তাহলে সেই প্রশ্নগুলোর উত্তর বাহ্যিকভাবে সত্য হলেও কিছু ত্রুটি থেকে যাবে। এজন্য যার বিয়ে তাকেই লিখতে হবে এমন শর্ত আবশ্যক করা হয়েছে। তবে অনেকেই আছেন বাংলা টাইপ করতে জানেন না। এক্ষেত্রে বাংলা টাইপ করতে জানেন এমন একজনকে পাশে বসিয়ে উনি উত্তরগুলো বলে দিবেন, টাইপ জানা ব্যক্তি লিখে ফর্মটি তৈরি করবেন।'
	},
	{
    id: 12,
		question: 'আমি বাংলা টাইপ করতে জানি না। আমি কিভাবে বায়োডাটা তৈরি করবো?',
		answer: 'এক্ষেত্রে বাংলা টাইপ করতে জানেন এমন একজনকে পাশে বসিয়ে আপনি উত্তরগুলো বলে দিবেন, টাইপ জানা ব্যক্তি লিখে ফর্মটি তৈরি করবেন। অবশ্যই উত্তরগুলো আপনার হতে হবে। নয়ত ত্রুটিযুক্ত উত্তর হবে, যা পাঠকের সাথে প্রতারণার শামিল ও ওয়েবসাইটের রুলস পরিপন্থী।'
	},
];